"""
Задание 3.
Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
Пример:
для списка [5, "string", 0.15, True, None]
результат
<class 'int'>
<class 'str'>
<class 'float'>
<class 'bool'>
<class 'NoneType'>
"""
lst = [5, "STRING", 0.15, True, None]
i = 0
while i < len(lst):
    print(f'{i+1} value is {lst[i]}, type is: {type(lst[i])}')
    i += 1
